# Data Frame

In [2]:
import pandas as pd

In [3]:
frame = pd.DataFrame({'numbers':range(10), 'chars':['a']*10})

In [4]:
frame

  chars  numbers
0     a        0
1     a        1
2     a        2
3     a        3
4     a        4
5     a        5
6     a        6
7     a        7
8     a        8
9     a        9

In [8]:
frame = pd.read_csv('dataset.tsv', header=0, sep='\t')

In [9]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [16]:
my_line = {'Name':'Рудякова Е.А.', 'Birth':'31.03.1997', 'City':'Киев', 'Position':'стажер'}

In [17]:
frame.append(my_line, ignore_index = True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6    Рудякова Е.А.  31.03.1997       Киев    стажер

In [18]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [22]:
frame = frame.append(my_line, ignore_index = True)

In [23]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6    Рудякова Е.А.  31.03.1997       Киев    стажер
7    Рудякова Е.А.  31.03.1997       Киев    стажер
8    Рудякова Е.А.  31.03.1997       Киев    стажер
9    Рудякова Е.А.  31.03.1997       Киев    стажер

In [24]:
frame.shape

(10, 4)

In [26]:
frame.columns

AttributeError: 'DataFrame' object has no attribute 'columnsm'

In [27]:
frame['IsStudent'] = [False]*5 + [True]*5

In [28]:
frame

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер     False
2       Белов М.М.  13.02.1980     Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер     False
5     Костров С.О.  31.05.1985     Москва    стажер      True
6    Рудякова Е.А.  31.03.1997       Киев    стажер      True
7    Рудякова Е.А.  31.03.1997       Киев    стажер      True
8    Рудякова Е.А.  31.03.1997       Киев    стажер      True
9    Рудякова Е.А.  31.03.1997       Киев    стажер      True

In [29]:
frame.drop([7,9], axis=0)

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер     False
2       Белов М.М.  13.02.1980     Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер     False
5     Костров С.О.  31.05.1985     Москва    стажер      True
6    Рудякова Е.А.  31.03.1997       Киев    стажер      True
8    Рудякова Е.А.  31.03.1997       Киев    стажер      True

In [34]:
frame

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер     False
2       Белов М.М.  13.02.1980     Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер     False
5     Костров С.О.  31.05.1985     Москва    стажер      True
6    Рудякова Е.А.  31.03.1997       Киев    стажер      True
7    Рудякова Е.А.  31.03.1997       Киев    стажер      True
8    Рудякова Е.А.  31.03.1997       Киев    стажер      True
9    Рудякова Е.А.  31.03.1997       Киев    стажер      True

In [36]:
frame.drop([7,8,9], axis=0, inplace=True)

In [37]:
frame

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер     False
2       Белов М.М.  13.02.1980     Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер     False
5     Костров С.О.  31.05.1985     Москва    стажер      True
6    Рудякова Е.А.  31.03.1997       Киев    стажер      True

In [39]:
frame.drop('IsStudent', axis=1, inplace=True)

In [40]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6    Рудякова Е.А.  31.03.1997       Киев    стажер

In [45]:
!cat dataset.tsv

Костров С.О.	31.05.1985	Москва	стажер

In [42]:
!echo dataset.tsv

dataset.tsv

In [43]:
frame.to_csv('new_dataset.tsv', header=True, index=None)

In [44]:
!cat new_dataset.tsv

Name,Birth,City,Position
Иванов А.А.,22.03.1980,Москва,
Сорокин И.В.,07.08.1965,Волгоград,инженер
Белов М.М.,13.02.1980,Ростов,менеджер
Мельникова Д.С.,15.04.1985,Ростов,
Рыбина Е.П.,19.11.1985,Москва,инженер
Костров С.О.,31.05.1985,Москва,стажер
Рудякова Е.А.,31.03.1997,Киев,стажер

In [46]:
!cat dataset.tsv

Костров С.О.	31.05.1985	Москва	стажер

In [48]:
frame.shape

(7, 4)

In [49]:
frame.size

28

In [50]:
frame['IsStudent'] = [True]*5 + [False]*2

In [51]:
frame

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      True
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      True
2       Белов М.М.  13.02.1980     Ростов  менеджер      True
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      True
4      Рыбина Е.П.  19.11.1985     Москва   инженер      True
5     Костров С.О.  31.05.1985     Москва    стажер     False
6    Рудякова Е.А.  31.03.1997       Киев    стажер     False